zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f403v(k-i-g-e-c-b)xx-pinctrl.h
/* TRACED2 */
#define TRACED2_PE5 \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, NORMP)

/* TRACED3 */
#define TRACED3_PE6 \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, NORMP)

/* UART3_RX */
#define UART3_RX_PC11 \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)

/* UART3_TX */
#define UART3_TX_PC10 \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, NORMP)

/* UART4_RX */
#define UART4_RX_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* UART4_TX */
#define UART4_TX_PC12 \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, NORMP)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USART0_RX */
#define USART0_RX_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_RMP)

/* USART0_TX */
#define USART0_TX_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_RMP)

/* USART1_CK */
#define USART1_CK_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, USART1_NORMP)
#define USART1_CK_PD7_RMP \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, USART1_RMP)

/* USART1_CTS */
#define USART1_CTS_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, USART1_NORMP)
#define USART1_CTS_PD3_RMP \
	GD32_PINMUX_AFIO('D', 3, GPIO_IN, USART1_RMP)

/* USART1_RTS */
#define USART1_RTS_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, USART1_NORMP)
#define USART1_RTS_PD4_RMP \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, USART1_RMP)

/* USART1_RX */
#define USART1_RX_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, USART1_NORMP)
#define USART1_RX_PD6_RMP \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, USART1_RMP)

/* USART1_TX */
#define USART1_TX_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, USART1_NORMP)
#define USART1_TX_PD5_RMP \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, USART1_RMP)

/* USART2_CK */
#define USART2_CK_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_PRMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_PRMP)
#define USART2_CK_PD10_FRMP \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, USART2_FRMP)

/* USART2_CTS */
#define USART2_CTS_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_NORMP)
#define USART2_CTS_PB13_PRMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_PRMP)
#define USART2_CTS_PD11_FRMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, USART2_FRMP)

/* USART2_RTS */
#define USART2_RTS_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_NORMP)
#define USART2_RTS_PB14_PRMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_PRMP)
#define USART2_RTS_PD12_FRMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, USART2_FRMP)

/* USART2_RX */
#define USART2_RX_PB11_NORMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_PRMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_PRMP)
#define USART2_RX_PD9_FRMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, USART2_FRMP)

/* USART2_TX */
#define USART2_TX_PB10_NORMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_PRMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_PRMP)
#define USART2_TX_PD8_FRMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, USART2_FRMP)

/* USBFS_DM */
#define USBFS_DM_PA11_INP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)
#define USBFS_DM_PA11_OUT \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* USBFS_DP */
#define USBFS_DP_PA12_INP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, NORMP)
#define USBFS_DP_PA12_OUT \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USBFS_ID */
#define USBFS_ID_PA10_INP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, NORMP)
#define USBFS_ID_PA10_OUT \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USBFS_VBUS */
#define USBFS_VBUS_PA9 \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, NORMP)

/* WKUP */
#define WKUP_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
